<template>
    <div class="faq">
        <header-block :white-list="true"/>
        <div class="container">
            <div class="row">
                <div class="col-sm-12">
                    <div class="panel">
                        <h3>
                            FAQ
                        </h3>
                        <div class="spoiler">

                        </div>
                    </div>
                </div>
            </div>
        </div>
    </div>
</template>

<script>
    import HeaderBlock from './layouts/HeaderBlock';

    export default {
        name: 'faq',
        components: {
            HeaderBlock
        },
        data() {
            return {
                sections: [
                    {
                        id: 1,
                        title: 'ICO',
                        questions: [
                            {
                                id: 1,
                                title: 'KYC',
                                text: 'Для прохождения KYC требуется паспорт и документ, подтверждающий адрес пребывания'
                            },
                            {
                                id: 2,
                                title: 'Ограничения',
                                text: 'Для прохождения KYC требуется паспорт и документ, подтверждающий адрес пребывания'
                            },
                            {
                                id: 3,
                                title: 'Когда планируется листинг на бирже?',
                                text: 'Листинг на первой бирже планируется сразу после окончания ICO. В данный момент ' +
                                    'ведутся переговоры сразу с несколькими биржами.'
                            },
                            {
                                id: 4,
                                title: 'Есть ли у вас MVP?',
                                text: 'Да, в данный момент доступна демо веб-версия платформы, так же есть возможность' +
                                    ' установки приложения на Mac и Linux. '
                            },
                            {
                                id: 5,
                                title: 'К какой юрисдикции относится ALEHUB?',
                                text: 'ALEHUB – проект компании Effective Energy LLC, которая зарегестрирована в Гонконге'
                            },
                            {
                                id: 6,
                                title: 'Какая минимальная сумма инвестицций?',
                                text: 'Минимальная сумма инвестиций составляет 30$'
                            }
                        ]
                    },
                    {
                        id: 2,
                        title: 'Продукт',
                        questions: [
                            {
                                id: 1,
                                title: 'Зачем нужен блокчейн?',
                                text: 'Поскольку отношения между заказчиком и исполнителем в, первую очередь, носят ' +
                                    'сугубо финансовый харакер и построены на доверии двух сторон, то блокчейн является ' +
                                    'идеальным решением, способным сохранить все детали работы над проектом. Решение, ' +
                                    'предлагаемое ALEHUB позволяет эффективно решить весь спектр проблем, присущий ' +
                                    'централизованным платформам.',
                                list: [
                                    {
                                        id: 1,
                                        title: 'Проблемы существующих централизованных платформ:',
                                        items: [
                                            'Биржи централизованны, а системы репутации и разрешения конфликтов ненадежны;',
                                            'Цель бирж фриланса заключаются в установлении контракта между заказчиком ' +
                                            'и исполнителем, формальные процедуры разрешения конфликтов не отраболтаны;',
                                            'Документация и процесс разработки программного обеспечения отделены от сделок;',
                                            'Возможности автоматизации процесса ограничиваются возможностями создателей' +
                                            ' биржи и поэтому чаще всего не отвечают требованиям заказчика;',
                                            'Многие функции систем предоставляются за дополнительную плату, что, фактически,' +
                                            ' означает порог вхождения для фрилансеров, определяемых не их ' +
                                            'профессиональными качествами и навыками, а готовностью заплатить ' +
                                            'определенную сумму за премиум-аккаунт;'
                                        ]
                                    },
                                    {
                                        id: 2,
                                        title: 'Эффективное решение с помощью блокчейна',
                                        items: [
                                            'Централизация исключается за счет использования технологии распределенных' +
                                            ' реестров данных, который поддерживается пиринговой сетью;',
                                            'Система оценки репутации оказывается недоступной  для вмешательства ' +
                                            'злоумышленников;',
                                            'Многосторонние смарт-контракты позволяют создать доверительные ' +
                                            'отношения между неограниченным количеством сторон;',
                                            'Интеграция систем управления версиями, ошибками, документацией;',
                                            'Решение всех конфликтов возможно с использованием механизмов консенсуса;',
                                            'Проектируемая система многоуровневых блокчейнов позволяет в рамках ' +
                                            'платформы объединить: систему заключения контрактов; систему управления ' +
                                            'версиями программного обеспечения; чата между двумя и более сторонами' +
                                            ' взаимодействия; подсистему  обновления и дополнения договоронностей ' +
                                            '(база договоров); подсистему хранения и обновления документации.'
                                        ]
                                    }
                                ]
                            },
                            {
                                id: 2,
                                title: 'Чем ALEHUB лучше классических инструментов?',
                                list: [
                                    {
                                        id: 1,
                                        title: 'Для Заказчиков:',
                                        items: [
                                            'Сокращение издержек на разработку IT продуктов;',
                                            'Уверенность в качестве выполненной работы;',
                                            'Многоуровневая система контроля качества;',
                                            'Оплата работ осуществляется в любой удобной валюте ' +
                                            '(вне зависимости от желаний исполнителя)',
                                            'Подтвержденный рейтинг исполнителей;',
                                            'Высокий уровень конфиденциальности (шифрование);',
                                            'Возможность заключения договора с несколькими подрядчиками;'
                                        ]
                                    },
                                    {
                                        id: 2,
                                        title: 'Для Исполнителей:',
                                        items: [
                                            'Обязательное техническое задание от заказчика, прошедшее проверку с ' +
                                            'помощью системы контроля качества;',
                                            'Прозрачная система рейтингования;',
                                            'Отсутствие скрытых платежей, комиссий и возможности покупки «накрученных»' +
                                            ' аккаунтов.',
                                            'Корректный поиск заказов, в соответствии с профессиональными качествами;',
                                            'Получение оплаты за любой заказ в валюте по выбору (как крипто-, так и фиатной)',
                                            'Минимальная комиссия за вывод средств'
                                        ]
                                    }
                                ]
                            },
                            {
                                id: 3,
                                title: 'Для чего в системе ALEHUB нужны майнеры?',
                                text: 'Майнеры выполняют работу по проверке и внесении корректных транзакций в ' +
                                    'распределенный реестр, исполняют смарт-контракты, а также проверяют наличие и ' +
                                    'корректность электронных подписей документов.'
                            },
                            {
                                id: 4,
                                title: 'За что платформа начисляет комиссии?',
                                list: [
                                    {
                                        id: 1,
                                        items: [
                                            'Исполнение смарт-контракта;',
                                            'Успешно завершенная сделка;',
                                            'Использование блокчейна для сохранения истории коммуникации (по выбору ' +
                                            'заказчика/исполнителя вся коммуникация по проекту может быть записана в ' +
                                            'блокчейн)',
                                            'Ввод/вывод средств'
                                        ]
                                    }
                                ]
                            },
                            {
                                id: 5,
                                title: 'Как начать выпорлнять заказы на платформе?',
                                text: 'Для того, чтобы получить доступ к заказам на платформе, необходимо подтвердить ' +
                                    'навыки, путем сдачи экзаменационных испытаний.'
                            }
                        ]
                    }
                ]
            }
        },
    }
</script>

<style lang="stylus" scoped>
.faq
    min-height 100vh
    background-color white

    .container
        padding-top 74px

        .panel
            margin-top 50px
</style>